---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator.#ctor
source: html/5bdcec64-1c38-33a6-e5ec-3a906b59fda5.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public TemperatureRatingTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.